# AreaSpringCoefficient Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SpecTypeId..::..AreaSpringCoefficient Property
SpecTypeId Class See Also
---
Area Spring Coefficient, in discipline Structural.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId AreaSpringCoefficient { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property AreaSpringCoefficient As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ AreaSpringCoefficient {
	ForgeTypeId^ get ();
}
```

# See Also
SpecTypeId Class
Autodesk.Revit.DB Namespace